       "use strict";
       
// 5 հատ For loop
//--------------1---------------------------------------
for (let i = 100 ; i>=0 ; i -= 10){
    if ( i === 50) {
        continue; }
   console.log( i ) ;
}   // 100 90 80 70 60 40 30 20 10 0

//--------------2---------------------------------------

for (let i = 0 ; i < 80 ; i += 20){
    if ( i === 60) {
        break; }
   console.log( i );
} // 0 20   40
//--------------3---------------------------------------

const name1 = [ 5, 4, 3, 2, 1 ];

for ( let i = 0; i <= 10 ; i++ ) {
    if (i === name1[2] ){ 
    break; }
  console.log ( i ) ;
}  // 0 1 2
//--------------4---------------------------------------

const app = [ "Alex", "Angel", "Max ", "Ani", "Davit" ];

for ( let i = 1; i <= 10 ; i++ ) {
    if (i === app.length ){ 
    break ; }
  console.log ( i + app[i-1] ) ;
} // 1 Alex  2 Angel  3 Max  4 Ani

//--------------5---------------------------------------

for (let i = 20 ; i > 10  ; i -= 5){
 
   console.log( i );
} //  20 , 15 

// 5 հատ while loop,
 
//--------------1---------------------------------------
/let num = 30;
while ( num  >= 25 ){
    console.log (`Հաճախորդը ${num} տարեկան է:`);
    num -- ;
}              /*Հաճախորդը 30 տարեկան է:
                Հաճախորդը 29 տարեկան է:
                Հաճախորդը 28 տարեկան է:
                Հաճախորդը 27 տարեկան է:
                Հաճախորդը 26 տարեկան է:
                Հաճախորդը 25 տարեկան է:*/
  
//--------------2---------------------------------------
let b = 10 ;

let c = 0 ;
while ( b  >= 1 ){
    b -- ;
    c ++ ;
    console.log (`${c} մեքենա գնելուց հետո խանումթում մնաց  ${b} հատ:`);
}   
                 /*1 մեքենա գնելուց հետո խանումթում մնաց  9 հատ:
                   2 մեքենա գնելուց հետո խանումթում մնաց  8 հատ:
                   3 մեքենա գնելուց հետո խանումթում մնաց  7 հատ:
                   4 մեքենա գնելուց հետո խանումթում մնաց  6 հատ:
                   5 մեքենա գնելուց հետո խանումթում մնաց  5 հատ:
                   6 մեքենա գնելուց հետո խանումթում մնաց  4 հատ:
                   7 մեքենա գնելուց հետո խանումթում մնաց  3 հատ:
                   8 մեքենա գնելուց հետո խանումթում մնաց  2 հատ:
                   9 մեքենա գնելուց հետո խանումթում մնաց  1 հատ:
                  10 մեքենա գնելուց հետո խանումթում մնաց  0 հատ:*/
//--------------3---------------------------------------
let index1 = 20 ;
while (index1 > 10){
    console.log(index1);
    if(index1 === 13){
       break;}
    index1 --;
} 
            //20,19,18,17,16,15,14,13;

//--------------4---------------------------------------
let text = "";
let a = 1;
while (a <= 5) {
    text += " Գլուխ " + a;
    a++;
    console.log(`ես կարդացել եմ գրքի ${text}`);
}
                 /*ես կարդացել եմ գրքի  Գլուխ 1
                   ես կարդացել եմ գրքի  Գլուխ 1 Գլուխ 2
                   ես կարդացել եմ գրքի  Գլուխ 1 Գլուխ 2 Գլուխ 3
                   ես կարդացել եմ գրքի  Գլուխ 1 Գլուխ 2 Գլուխ 3 Գլուխ 4
                   ես կարդացել եմ գրքի  Գլուխ 1 Գլուխ 2 Գլուխ 3 Գլուխ 4 Գլուխ 5*/
//--------------5---------------------------------------
const phones = ["Iphone ", "Samsung ", "LG ", "Sony "];
let i = 0;
let text1 = "";
while (phones [i]) {
       text1 += phones [i];
       i++;
  console.log(text1);
}                            /*  Iphone 
                                 Iphone Samsung 
                                 Iphone Samsung LG 
                                 Iphone Samsung LG Sony*/
//----------2-----------------------------------------------


//1 հատ էլ do whille loop
let  abc = 10;
do {
   console.log(abc) ; 
   abc -- ;
} while (abc < 0) ;

// 10;