"use strict";
/*
1. Ձեր պատկերացումով փոփոխում և օպտիմիզացնում եք filmapp.js-ը, 
որ կոդը էլ ավելի կարճանա ու էլ ավելի արագ աշխատի

2․ ստեղծում եք 20 օրինակ Destructuring-ի, այսինքն 10 հատ զանգված 10 հատ օբջեքթ, կեսը  պետք է լինեն ճյուղավորված
 գոնե 1 աստիճան, այսինքն զանգվածի մեջ զանգված, օբջեքթի մեջ օբջեքթ, բայց պետք է լինեն նաև չճյուղավորվածները
*/
//----------------1--------------------------------array
const fruits = ["Orange", "banan", "apple", "lemon"];
const [a, b, c] = fruits;
console.log(`${a} and ${c} are my favorite fruits.`);

//----------------2--------------------------------
const list = [];
const [a11 = 1, a12 = 20, a13 = 59, a14 = 100, a15 = 66] = list;
console.log(a11);

//----------------3-------------------------------

//----------------4--------------------------------
//----------------5--------------------------------
//----------------6--------------------------------
//----------------7--------------------------------
//----------------8--------------------------------
//----------------9--------------------------------
let a2, b2;
[a2 = 5, b2 = 7] = [1, 20];
console.log(a2); 
console.log(b2);
//
let a3 = 1;
let b3 = 3;

[a3, b3] = [b3, a3];
console.log(a3); // 3
console.log(b3); // 1
//----------------10-------------------------------- objects
const user1 = {
    name: "Alex",
    age: 30,
    pictures: 20,
    videos: 1,
     
};

function userInfo1 ({name, age, pictures}) {   
    console.log(`${name} is ${age} years old and has  ${pictures} pictures.`);
}
userInfo1(user1);

//----------------11--------------------------------
const user2 = {
    name: "Alex",
    age: 30,
    pictures: 20,
    videos: 1
   // friends: [],  
};

function userInfo2 ({name:a, age:b, pictures:c, friends :d = ["Joe","Adam", "Ani"]}) {   
    console.log(`${a} is ${b} years old and has  ${c} pictures, ${d.length} friends`);
}
userInfo2(user2);
//----------------12--------------------------------
const user3 = {
    name: "Alex",
    age: 30,
    pictures: 20,
    videos: 1,
    friends: ["Joe", "Adam",  "Ani"],  
};

function userInfo3 ({name:a, age:b, friends :d }) {   
    console.log(`${a} is ${b} years old and  ${d[2]} his best friend.`);
}
userInfo3(user3);
//----------------13--------------------------------
//----------------14--------------------------------
//----------------15--------------------------------
//----------------16--------------------------------
//----------------17--------------------------------
//----------------18--------------------------------
//----------------19--------------------------------
//----------------20--------------------------------

